package com.shabelnikd.bookstorage.data.models

data class Book(
    val title: String,
    val year: String,
    val author: String,
    val genre: String,
) {
    companion object {

        fun getStaticData(): List<Book> = listOf(
            Book("1984", "1949", "Джордж Оруэлл", "Антиутопия"),
            Book("Гордость и предубеждение", "1813", "Джейн Остин", "Роман"),
            Book("Убить пересмешника", "1960", "Харпер Ли", "Роман"),
            Book("Великий Гэтсби", "1925", "Фрэнсис Скотт Фицджеральд", "Роман"),
            Book("Сто лет одиночества", "1967", "Габриэль Гарсиа Маркес", "Магический реализм"),
            Book("Над пропастью во ржи", "1951", "Джером Сэлинджер", "Роман воспитания"),
            Book("Мастер и Маргарита", "1967", "Михаил Булгаков", "Роман"),
            Book("Преступление и наказание", "1866", "Федор Достоевский", "Философский роман"),
            Book("Война и мир", "1869", "Лев Толстой", "Исторический роман"),
            Book("Анна Каренина", "1877", "Лев Толстой", "Роман"),
            Book("Маленький принц", "1943", "Антуан де Сент-Экзюпери", "Повесть-сказка"),
            Book("О дивный новый мир", "1932", "Олдос Хаксли", "Антиутопия"),
            Book("451 градус по Фаренгейту", "1953", "Рэй Брэдбери", "Научная фантастика"),
            Book("Портрет Дориана Грея", "1890", "Оскар Уайльд", "Философский роман"),
            Book("Приключения Гекльберри Финна", "1884", "Марк Твен", "Приключения"),
            Book("Моби Дик", "1851", "Герман Мелвилл", "Приключения"),
            Book("Джейн Эйр", "1847", "Шарлотта Бронте", "Роман"),
            Book("Грозовой перевал", "1847", "Эмили Бронте", "Роман"),
            Book("Три мушкетера", "1844", "Александр Дюма", "Исторический роман"),
            Book("Граф Монте-Кристо", "1844", "Александр Дюма", "Приключения"),
            Book("Отверженные", "1862", "Виктор Гюго", "Исторический роман"),
            Book("Алиса в Стране чудес", "1865", "Льюис Кэрролл", "Фэнтези"),
            Book("Хроники Нарнии: Лев, колдунья и платяной шкаф", "1950", "К. С. Льюис", "Фэнтези"),
            Book("Гарри Поттер и философский камень", "1997", "Джоан Роулинг", "Фэнтези"),
            Book("Хоббит", "1937", "Дж. Р. Р. Толкин", "Фэнтези"),
            Book("Властелин колец: Братство Кольца", "1954", "Дж. Р. Р. Толкин", "Фэнтези"),
            Book("Божественная комедия", "1320", "Данте Алигьери", "Эпос"),
            Book("Ромео и Джульетта", "1597", "Уильям Шекспир", "Трагедия"),
            Book("Гамлет", "1603", "Уильям Шекспир", "Трагедия"),
            Book("Одиссея", "~VIII в. до н.э.", "Гомер", "Эпос")
        )

    }
}